{
    "token2id": {
        "[PAD]": 0,
        "[UNK]": 1,
        "[CLS]": 2,
        "[SEP]": 3,
        "[MASK]": 4,
        "<ip>:<num> Served block <block_id> to /<ip>": 5,
        "<ip>:<num> Starting thread to transfer block <block_id> to <ip>:<num>": 6,
        "<ip>:<num> Starting thread to transfer block <block_id> to <ip>:<num>, <ip>:<num>": 7,
        "<ip>:<num>:Exception writing block <block_id> to mirror <ip>:<num>": 8,
        "<ip>:<num>:Failed to transfer <block_id> to <ip>:<num> got java.io.IOException: Connection reset by peer": 9,
        "<ip>:<num>:Got exception while serving <block_id> to /<ip>:": 10,
        "<ip>:<num>:Transmitted block <block_id> to <ip>": 11,
        "BLOCK* NameSystem.addStoredBlock: Redundant addStoredBlock request received for <block_id> on <ip>:<num> size <num>": 12,
        "BLOCK* NameSystem.addStoredBlock: addStoredBlock request received for <block_id> on <ip>:<num> size <num> But it does not belong to any file.": 13,
        "BLOCK* NameSystem.addStoredBlock: blockMap updated: <ip>:<num> is added to <block_id> size <num>": 14,
        "BLOCK* NameSystem.allocateBlock: <path> <block_id>": 15,
        "BLOCK* NameSystem.allocateBlock: <path><num>-<num>-<num>-<num>.ec2.internal_1226291400491_job_200811092030_0001_conf.xml. <block_id>": 16,
        "BLOCK* NameSystem.allocateBlock: <path><num>-<num>-<num>-<num>.ec2.internal_1226291400491_job_200811092030_0001_root_random-writer. <block_id>": 17,
        "BLOCK* NameSystem.allocateBlock: <path><num>-<num>-<num>-<num>.ec2.internal_1226291400491_job_200811092030_0002_conf.xml. <block_id>": 18,
        "BLOCK* NameSystem.allocateBlock: <path><num>-<num>-<num>-<num>.ec2.internal_1226291400491_job_200811092030_0002_root_sorter. <block_id>": 19,
        "BLOCK* NameSystem.allocateBlock: <path><num>. <block_id>": 20,
        "BLOCK* NameSystem.delete: <block_id> is added to invalidSet of <ip>:<num>": 21,
        "BLOCK* ask <ip>:<num> to replicate <block_id> to datanode(s) <ip>:<num>": 22,
        "BLOCK* ask <ip>:<num> to replicate <block_id> to datanode(s) <ip>:<num> <ip>:<num>": 23,
        "Changing block file offset of block <block_id> from <num> to <num> meta file offset to <num>": 24,
        "Deleting block <block_id> file <path><block_id>": 25,
        "Exception in receiveBlock for block <block_id> java.io.EOFException": 26,
        "Exception in receiveBlock for block <block_id> java.io.IOException: Connection reset by peer": 27,
        "Exception in receiveBlock for block <block_id> java.io.InterruptedIOException: Interruped while waiting for IO on channel java.nio.channels.SocketChannel[connected local=<ip> remote=<ip>]. <num> millis timeout left.": 28,
        "PacketResponder <block_id> <num> Exception java.io.EOFException": 29,
        "PacketResponder <block_id> <num> Exception java.io.IOException: Broken pipe": 30,
        "PacketResponder <block_id> <num> Exception java.io.InterruptedIOException: Interruped while waiting for IO on channel java.nio.channels.SocketChannel[connected local=<ip> remote=<ip>]. <num> millis timeout left.": 31,
        "PacketResponder <block_id> <num> Exception java.net.SocketTimeoutException: <num> millis timeout while waiting for channel to be ready for read. ch : java.nio.channels.SocketChannel[connected local=<ip> remote=<ip>]": 32,
        "PacketResponder <num> for block <block_id> Interrupted.": 33,
        "PacketResponder <num> for block <block_id> terminating": 34,
        "Received block <block_id> of size <num> from /<ip>": 35,
        "Received block <block_id> src: <ip> dest: <ip> of size <num>": 36,
        "Receiving block <block_id> src: <ip> dest: <ip>": 37,
        "Receiving empty packet for block <block_id>": 38,
        "Unexpected error trying to delete block <block_id>. BlockInfo not found in volumeMap.": 39,
        "Verification succeeded for <block_id>": 40,
        "writeBlock <block_id> received exception java.io.EOFException": 41,
        "writeBlock <block_id> received exception java.io.IOException: Block <block_id> is valid, and cannot be written to.": 42,
        "writeBlock <block_id> received exception java.io.IOException: Connection reset by peer": 43,
        "writeBlock <block_id> received exception java.io.IOException: Could not read from stream": 44,
        "writeBlock <block_id> received exception java.io.InterruptedIOException: Interruped while waiting for IO on channel java.nio.channels.SocketChannel[connected local=<ip> remote=<ip>]. <num> millis timeout left.": 45,
        "writeBlock <block_id> received exception java.net.SocketTimeoutException": 46
    },
    "id2token": {
        "0": "[PAD]",
        "1": "[UNK]",
        "2": "[CLS]",
        "3": "[SEP]",
        "4": "[MASK]",
        "5": "<ip>:<num> Served block <block_id> to /<ip>",
        "6": "<ip>:<num> Starting thread to transfer block <block_id> to <ip>:<num>",
        "7": "<ip>:<num> Starting thread to transfer block <block_id> to <ip>:<num>, <ip>:<num>",
        "8": "<ip>:<num>:Exception writing block <block_id> to mirror <ip>:<num>",
        "9": "<ip>:<num>:Failed to transfer <block_id> to <ip>:<num> got java.io.IOException: Connection reset by peer",
        "10": "<ip>:<num>:Got exception while serving <block_id> to /<ip>:",
        "11": "<ip>:<num>:Transmitted block <block_id> to <ip>",
        "12": "BLOCK* NameSystem.addStoredBlock: Redundant addStoredBlock request received for <block_id> on <ip>:<num> size <num>",
        "13": "BLOCK* NameSystem.addStoredBlock: addStoredBlock request received for <block_id> on <ip>:<num> size <num> But it does not belong to any file.",
        "14": "BLOCK* NameSystem.addStoredBlock: blockMap updated: <ip>:<num> is added to <block_id> size <num>",
        "15": "BLOCK* NameSystem.allocateBlock: <path> <block_id>",
        "16": "BLOCK* NameSystem.allocateBlock: <path><num>-<num>-<num>-<num>.ec2.internal_1226291400491_job_200811092030_0001_conf.xml. <block_id>",
        "17": "BLOCK* NameSystem.allocateBlock: <path><num>-<num>-<num>-<num>.ec2.internal_1226291400491_job_200811092030_0001_root_random-writer. <block_id>",
        "18": "BLOCK* NameSystem.allocateBlock: <path><num>-<num>-<num>-<num>.ec2.internal_1226291400491_job_200811092030_0002_conf.xml. <block_id>",
        "19": "BLOCK* NameSystem.allocateBlock: <path><num>-<num>-<num>-<num>.ec2.internal_1226291400491_job_200811092030_0002_root_sorter. <block_id>",
        "20": "BLOCK* NameSystem.allocateBlock: <path><num>. <block_id>",
        "21": "BLOCK* NameSystem.delete: <block_id> is added to invalidSet of <ip>:<num>",
        "22": "BLOCK* ask <ip>:<num> to replicate <block_id> to datanode(s) <ip>:<num>",
        "23": "BLOCK* ask <ip>:<num> to replicate <block_id> to datanode(s) <ip>:<num> <ip>:<num>",
        "24": "Changing block file offset of block <block_id> from <num> to <num> meta file offset to <num>",
        "25": "Deleting block <block_id> file <path><block_id>",
        "26": "Exception in receiveBlock for block <block_id> java.io.EOFException",
        "27": "Exception in receiveBlock for block <block_id> java.io.IOException: Connection reset by peer",
        "28": "Exception in receiveBlock for block <block_id> java.io.InterruptedIOException: Interruped while waiting for IO on channel java.nio.channels.SocketChannel[connected local=<ip> remote=<ip>]. <num> millis timeout left.",
        "29": "PacketResponder <block_id> <num> Exception java.io.EOFException",
        "30": "PacketResponder <block_id> <num> Exception java.io.IOException: Broken pipe",
        "31": "PacketResponder <block_id> <num> Exception java.io.InterruptedIOException: Interruped while waiting for IO on channel java.nio.channels.SocketChannel[connected local=<ip> remote=<ip>]. <num> millis timeout left.",
        "32": "PacketResponder <block_id> <num> Exception java.net.SocketTimeoutException: <num> millis timeout while waiting for channel to be ready for read. ch : java.nio.channels.SocketChannel[connected local=<ip> remote=<ip>]",
        "33": "PacketResponder <num> for block <block_id> Interrupted.",
        "34": "PacketResponder <num> for block <block_id> terminating",
        "35": "Received block <block_id> of size <num> from /<ip>",
        "36": "Received block <block_id> src: <ip> dest: <ip> of size <num>",
        "37": "Receiving block <block_id> src: <ip> dest: <ip>",
        "38": "Receiving empty packet for block <block_id>",
        "39": "Unexpected error trying to delete block <block_id>. BlockInfo not found in volumeMap.",
        "40": "Verification succeeded for <block_id>",
        "41": "writeBlock <block_id> received exception java.io.EOFException",
        "42": "writeBlock <block_id> received exception java.io.IOException: Block <block_id> is valid, and cannot be written to.",
        "43": "writeBlock <block_id> received exception java.io.IOException: Connection reset by peer",
        "44": "writeBlock <block_id> received exception java.io.IOException: Could not read from stream",
        "45": "writeBlock <block_id> received exception java.io.InterruptedIOException: Interruped while waiting for IO on channel java.nio.channels.SocketChannel[connected local=<ip> remote=<ip>]. <num> millis timeout left.",
        "46": "writeBlock <block_id> received exception java.net.SocketTimeoutException"
    }
}